app/Http/Middleware/AdminMiddleware.php

    public function handle($request, Closure $next)
    {
        if ($this->auth->guest()) {
            if ($request->ajax()) {
                return response('Unauthorized.', 401);
            } else {
                return redirect()->guest(route('admin-login'));
            }
        }

        if (!Auth::check()) {
            return redirect(route('admin-login'));
        }
        $setting_list = Setting::pluck('setting_value', 'setting_name')->all();
---
select `setting_value`, `setting_name` from `settings`