app/Http/Controllers/admin/course/programcodes/IndexController.php

select `name`, `id` from `institutions`
select `name`, `id` from `campuses`
---
    public function __invoke(Request $request)
    {
        //
        $params = $request->all();

        $list = Programcode::getAdminList($params);

        $institution_list = Institution::pluck('name','id');

        $campus_list = Campus::pluck('name','id');