app/Models/Activity/ActivityLog.php

insert into `activity_logs` (`activity_type`, `log_type`, `title`, `action`, `user_id`, `unique_id`, `updated_at`, `created_at`) values ('Manual', 'Login', 'Login Successful', '<strong><a href=\"http://127.0.0.1:8000/admin/iam/personnels/PER-LMJZ-336U/edit\" target=\"_blank\">stdev [PER-LMJZ-336U]</a></strong> has successfully logged in', 7, 'ACT-3AY7-E5NM', '2024-03-20 09:38:17', '2024-03-20 09:38:17')
---
    public static function addLog($arr)
    {

        if (!isset($arr['activity_type'])) {
            $arr['activity_type'] = 'Manual';
        }

        $activity_log_item = self::create($arr);

insert into `activity_log_items` (`subject`, `subject_id`, `activity_log_id`, `unique_id`, `updated_at`, `created_at`) values ('User', 7, 76, 'AI-SU6F-OXGS', '2024-03-20 09:38:17', '2024-03-20 09:38:17')
---
            }

            if (is_array($log_item_arr) && count($log_item_arr) > 0) {
                $activity_log_item->acitivity_log_items()->createMany($log_item_arr);