app/Http/Controllers/admin/person/students/ViewController.php

    public function __invoke($unique_id, Request $request)
    {
        $params = $request->all();

        if(!Helper::checkPermission('students.view')){
            return redirect()->route('admin-dashboard');
        }
        $item = Student::where('unique_id', $unique_id)->first();
---
select * from `students` where `unique_id` = 'STU-VE1A-P3TX-RLEZ' limit 1