app/Exceptions/Handler.php

    public function register()
    {
        $this->renderable(function (NotFoundHttpException $e, $request) {
            if ($request->is('admin/*')) {
                return response()->view('errors.admin.404');
            } else if ($request->is('*')) {
                // Settings for exception pages
                try{
                    $setting_list = Setting::pluck('setting_value', 'setting_name')->all();
---
select `setting_value`, `setting_name` from `settings`