app/Models/person/Student.php

    public static function getAdminList($params)
    {
        $all_search_fields = array_keys(self::$searchColumns);
        $query = Helper::generateFrontListQuery(self::query(), $params, $all_search_fields);

        if (isset($params['search_status']) && $params['search_status'] != null && $params['search_status'] != '') {
            $query->where('status', $params['search_status']);
        }

        //dd($params, $query->toSql());
        $list = null;
        if (isset($params['export']) && $params['export'] == true) {
            $list = $query->get();
        } else {
            $page_num = isset($params['page']) && $params['page'] > 0 ? $params['page'] : 1;
            $record_per_page = isset($params['per_page']) && $params['per_page'] > 0 ? $params['per_page'] : env('APP_RECORDS_PER_PAGE', 20);
            $list = $query->paginate($record_per_page, ['*'], 'page', $page_num);
---
select * from `students` order by `id` desc limit 20 offset 0
select count(*) as aggregate from `students`

    public function studentVl($v_reference_no) {
        $student =  \DB::connection('mysql2')->table('students')->select('*')->where('v_reference_no', $v_reference_no)->first();

        if($student != null) {
            $studentdata = json_decode(json_encode($student), true);

            $vl = \DB::connection('mysql2')->table('student_vl_letters')->select('*')->where('student_id',$studentdata['id'])->latest()->first();
            $vldata = json_decode(json_encode($vl), true);

            $media = \DB::connection('mysql2')->table('media')->select('original_file_name')->where('id',$vldata['media_id'])->first();
---
select * from `students` where `v_reference_no` = 'ABS/2024/383159' limit 1
select * from `student_vl_letters` where `student_id` = 2929 order by `created_at` desc limit 1
select `original_file_name` from `media` where `id` = 286 limit 1

    public function studentVlArchieve($vista_id) {
         $student =  \DB::connection('mysql2')->table('students')->select('*')->where('vista_id', $vista_id)->first();

         if($student != null) {
            $studentdata = json_decode(json_encode($student), true);

            $vla = \DB::connection('mysql2')->table('student_vl_letters_archives')->select('*')->where('student_id',$studentdata['id'])->where('type1',null)->latest()->get();
            $vladata = json_decode(json_encode($vla), true);
            $str = "";
            if(count($vladata) > 0) {
                foreach ($vladata as $key => $data) {
                    $str .= "<tr><td>".date("d/m/Y", strtotime($data['created_at']))."</td>";
                    if($data['media_id'] != null) {
                        $media = \DB::connection('mysql2')->table('media')->select('original_file_name')->where('id',$data['media_id'])->first();
---
select * from `students` where `vista_id` = '2' limit 1
select * from `student_vl_letters_archives` where `student_id` = 2 and `type1` is null order by `created_at` desc
select `original_file_name` from `media` where `id` = 264 limit 1

    public function studentCol($v_reference_no) {
        $student =  \DB::connection('mysql2')->table('students')->select('*')->where('v_reference_no', $v_reference_no)->first();

        if($student != null) {
            $studentdata = json_decode(json_encode($student), true);

            $vl = \DB::connection('mysql2')->table('student_col_offers')->select('*')->where('student_id',$studentdata['id'])->latest()->first();
            $vldata = json_decode(json_encode($vl), true);

            $media = \DB::connection('mysql2')->table('media')->select('original_file_name')->where('id',$vldata['media_id'])->first();
---
select * from `students` where `v_reference_no` = 'CSSS/2023/749509' limit 1
select * from `student_col_offers` where `student_id` = 2 order by `created_at` desc limit 1
select `original_file_name` from `media` where `id` = 24 limit 1

    public function studentColArchieve($vista_id) {
        $student =  \DB::connection('mysql2')->table('students')->select('*')->where('vista_id', $vista_id)->first();

        if($student != null) {
            $studentdata = json_decode(json_encode($student), true);

            $cola = \DB::connection('mysql2')->table('student_col_offers_archives')->select('*')->where('student_id',$studentdata['id'])->latest()->get();
            $coladata = json_decode(json_encode($cola), true);
            $str = "";
            if(count($coladata) > 0) {
                foreach ($coladata as $key => $data) {
                    $str .= "<tr><td>".date("d/m/Y", strtotime($data['created_at']))."</td>";
                    if($data['media_id'] != null) {
                        $media = \DB::connection('mysql2')->table('media')->select('original_file_name')->where('id',$data['media_id'])->first();
---
select * from `students` where `vista_id` = '2' limit 1
select * from `student_col_offers_archives` where `student_id` = 2 order by `created_at` desc
select `original_file_name` from `media` where `id` = 24 limit 1