app/Http/Controllers/admin/cms/subjects/IndexController.php

select `program_name`, `id` from `programcodes`
select CONCAT(first_name, ' ', last_name) AS full_name, `id` from `faculties` where `status` = 'Active'
---
    public function __invoke(Request $request)
    {
        //
        $params = $request->all();

        $list = Subject::getAdminList($params);

        $programcode_list = Programcode::pluck('program_name','id');
        $faculty_list = Faculty::select(DB::raw("CONCAT(first_name, ' ', last_name) AS full_name"),"id")->where('status','Active')->pluck("full_name","id");