app/Http/Controllers/admin/campaign/campus/IndexController.php

    public function __invoke(Request $request)
    {

        $params = $request->all();

        $list = Campus::getAdminList($params);

        $institution_list = Institution::pluck('name','id');
---
select `name`, `id` from `institutions`