app/Models/cms/Subject.php

select count(*) as aggregate from `subjects`
---
    public static function getAdminList($params)
    {
        $all_search_fields = array_keys(self::$searchColumns);
        $query = Helper::generateAdminListQuery(self::query(), $params, $all_search_fields);

        if (isset($params['search_status']) && $params['search_status'] != null && $params['search_status'] != '') {
            $query->where('status', $params['search_status']);
        }

        if (isset($params['programcode_id']) && $params['programcode_id'] != null && $params['programcode_id'] != '') {
            $query->where('subjects.programcode_id', $params['programcode_id']);
        }

        if (isset($params['faculty_id']) && $params['faculty_id'] != null && $params['faculty_id'] != '') {
            $query->where('subjects.faculty_id', $params['faculty_id']);
        }

        //$query->with(['media']);

        $list = null;
        if (isset($params['export']) && $params['export'] == true) {
            $list = $query->get();
        } else {
            $page_num = isset($params['page']) && $params['page'] > 0 ? $params['page'] : 1;
            $record_per_page = isset($params['per_page']) && $params['per_page'] > 0 ? $params['per_page'] : env('APP_RECORDS_PER_PAGE', 20);
            $list = $query->paginate($record_per_page, ['*'], 'page', $page_num);