app/Actions/admin/auth/UserLogin.php

update `users` set `last_login_at` = '2024-03-20 09:38:17', `users`.`updated_at` = '2024-03-20 09:38:17' where `id` = 7
---
    public function handle(User $user_item, Request $request)
    {

        $user_item->last_login_at = \Carbon\Carbon::now()->format('Y-m-d H:i:s');
        $user_item->save();